---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhasec
source: html/5c48beb7-a81a-605f-da5e-0778274c7671.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhasec Property

"Feed Through Lugs Current Phase C"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasec { get; }
```